openfoam_cases/threeFin_case/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
24000
(
(-2.475 -0.475 -0.475)
(-2.425 -0.475 -0.475)
(-2.375 -0.475 -0.475)
(-2.325 -0.475 -0.475)
(-2.275 -0.475 -0.475)
(-2.225 -0.475 -0.475)
(-2.175 -0.475 -0.475)
(-2.125 -0.475 -0.475)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(-2.5 -0.475 -0.475)
(-2.5 -0.425 -0.475)
(-2.5 -0.375 -0.475)
(-2.5 -0.325 -0.475)
(-2.5 -0.275 -0.475)
(-2.5 -0.225 -0.475)
(-2.5 -0.175 -0.475)
(-2.5 -0.125 -0.475)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(0.5 -0.475 -0.475)
(0.5 -0.425 -0.475)
(0.5 -0.375 -0.475)
(0.5 -0.325 -0.475)
(0.5 -0.275 -0.475)
(0.5 -0.225 -0.475)
(0.5 -0.175 -0.475)
(0.5 -0.125 -0.475)
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
4800
(
(-2.475 -0.5 -0.475)
(-2.475 -0.5 -0.425)
(-2.475 -0.5 -0.375)
(-2.475 -0.5 -0.325)
(-2.475 -0.5 -0.275)
(-2.475 -0.5 -0.225)
(-2.475 -0.5 -0.175)
(-2.475 -0.5 -0.125)
...
)
;
    }
}


// ************************************************************************* //
