openfoam_cases/threeFin_case/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
24000
(
-2.475
-2.425
-2.375
-2.325
-2.275
-2.225
-2.175
-2.125
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
-2.5
-2.5
-2.5
-2.5
-2.5
-2.5
-2.5
-2.5
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.5
0.5
0.5
0.5
0.5
0.5
0.5
0.5
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
4800
(
-2.475
-2.475
-2.475
-2.475
-2.475
-2.475
-2.475
-2.475
...
)
;
    }
}


// ************************************************************************* //
