openfoam_cases/threeFin_case/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
24000
(
-0.475
-0.475
-0.475
-0.475
-0.475
-0.475
-0.475
-0.475
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
-0.475
-0.475
-0.475
-0.475
-0.475
-0.475
-0.475
-0.475
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
-0.475
-0.475
-0.475
-0.475
-0.475
-0.475
-0.475
-0.475
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
4800
(
-0.475
-0.425
-0.375
-0.325
-0.275
-0.225
-0.175
-0.125
...
)
;
    }
}


// ************************************************************************* //
