openfoam_cases/threeFin_case/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.00375;
boundaryField
{
    inlet   { type fixedValue; value uniform 0.00375; }
    outlet  { type zeroGradient; }
    walls   { type kqRWallFunction; value uniform 0.00375; }
    fins    { type kqRWallFunction; value uniform 0.00375; }
}
