openfoam_cases/threeFin_case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale 1;
vertices
(
    (-2.5 -0.5 0.0)
    ( 2.5 -0.5 0.0)
    ( 2.5  0.5 0.0)
    (-2.5  0.5 0.0)
    (-2.5 -0.5 0.6)
    ( 2.5 -0.5 0.6)
    ( 2.5  0.5 0.6)
    (-2.5  0.5 0.6)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (100 40 30) simpleGrading (1 1 1)
);
boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
