openfoam_cases/threeFin_case/system/controlDict
pOutlet
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
        writeInterval   50;
        operation       areaAverage;
        regionType      patch;
        name            outlet;
        fields          (p);
        writeFields     false;
    }
    Tmax
    {
        type            fieldMinMax;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
        writeInterval   50;
        fields          (T);
    }FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         500;
deltaT          1;
writeControl    timeStep;
writeInterval   100;
purgeWrite      3;
writeFormat     ascii;
writePrecision  8;
runTimeModifiable true;
functions
{
    pressureDrop
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
        writeInterval   50;
        operation       areaAverage;
        regionType      patch;
        name            inlet;
        fields          (p);
        writeFields     false;
    }
}
