openfoam_cases/threeFin_case/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
pointSync false;
patches
(
    {
        name            fins;
        patchInfo
        {
            type            wall;
            inGroups        (wall);
        }
        constructFrom   set;
        set             finFaces;
    }
);
EOFcat > system/topoSetDict << 'EOF'
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
actions
(
    {
        name    allFinCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-1.5 -0.05 0.0) (1.5 0.05 0.4);
    }
    {
        name    allFinCells;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (-1.5 -0.4 0.0) (1.5 -0.3 0.4);
    }
    {
        name    allFinCells;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (-1.5 0.3 0.0) (1.5 0.4 0.4);
    }
    {
        name    finFaces;
        type    faceSet;
        action  new;
        source  cellToFace;
        set     allFinCells;
        option  boundary;
    }
);
