openfoam_cases/threeFin_case/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
ddtSchemes      { default steadyState; }
gradSchemes     { default Gauss linear; }
divSchemes
{
    default                                 none;
    div(phi,U)                              Gauss linearUpwind grad(U);
    div(phi,k)                              Gauss upwind;
    div(phi,epsilon)                        Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))           Gauss linear;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes   { default corrected; }
