openfoam_cases/threeFin_case/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    p           { solver GAMG; smoother GaussSeidel; tolerance 1e-7; relTol 0.01; }
    U               { solver smoothSolver; smoother GaussSeidel; tolerance 1e-7; relTol 0.1; }
    k               { solver smoothSolver; smoother GaussSeidel; tolerance 1e-7; relTol 0.1; }
    epsilon         { solver smoothSolver; smoother GaussSeidel; tolerance 1e-7; relTol 0.1; }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    residualControl { p 1e-4; U 1e-4; k 1e-4; epsilon 1e-4; }
}
relaxationFactors { fields { p 0.3; } equations { U 0.7; k 0.7; epsilon 0.7; } }
