openfoam_cases/threeFin_case/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
actions
(
    {
        name    allFinCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.5 -0.05 0.0) (0.5 0.05 0.4);
    }
    {
        name    allFinCells;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (-0.5 -0.4 0.0) (0.5 -0.3 0.4);
    }
    {
        name    allFinCells;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (-0.5 0.3 0.0) (0.5 0.4 0.4);
    }
    {
        name    allFinCells;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     allFinCells;
    }
);
